{
  "name": "FATHUL HIDAYAT",
  "title": "Software Developer",
  "about": {
    "brief": "Software developer with 3 years of experience in Flutter and native development, passionate about creating efficient and user-friendly applications.",
    "description": "Software developer with 3 years of programming experience, specializing in Flutter and native development. Passionate about building efficient, user-friendly applications with clean and maintainable code. Quick learner with strong problem-solving skills, eager to contribute and grow in a professional development environment.",
    "workHistory": [
      {
        "company": "PT UniGuard Indonesia",
        "position": "Mobile Developer",
        "location": "Bandung, West Java",
        "period": "August 2024 - Present",
        "image": "/src/assets/images/company/uniguard.png",
        "description": "Developed internal applications to enhance operational efficiency. Built applications using Flutter (with Riverpod) for state management and native platforms (Kotlin, Java, Swift). Translated business requirements into functional and scalable software solutions. Worked closely with cross-functional teams to design and implement new features. Optimized application performance and resolved technical issues. Maintained clean, modular, and well-documented code for future development."
      },
      {
        "company": "PT Zen Multimedia Indonesia",
        "position": "Flutter Mobile Developer",
        "location": "Purwakarna, West Java",
        "period": "June 2023 - July 2024",
        "image": "/src/assets/images/company/zmi.png",
        "description": "Designed and implemented new features in mobile apps using Flutter, implemented BloC architecture, fixed bugs, and learned best practices in software development."
      },
      {
        "company": "Prahwa",
        "position": "Android Developer, Internship",
        "location": "Tasikmalaya, West Java",
        "period": "July 2022 - October 2022",
        "image": "/src/assets/images/company/prahwa.png",
        "description": "Learned Dart and Flutter from basic, slicing UI design from Figma, created example projects, and implemented BloC state management and clean architecture."
      }
    ]
  },
  "skills": [
    { "name": "Flutter", "level": 90, "category": "mobile" },
    { "name": "Kotlin", "level": 85, "category": "android" },
    { "name": "Java", "level": 85, "category": "android" },
    { "name": "Swift", "level": 50, "category": "ios" },
    { "name": "JavaScript", "level": 75, "category": "web" },
    { "name": "PHP", "level": 80, "category": "web" }
  ],
  "projects": [
    {
      "id": 1,
      "title": "Bebunge",
      "description": "Bebunge is a One-Stop Portal Service owned by the Bekasi Regency Communication, Informatics, Cryptography and Statistics Service. With Bebunge, the public will get information about government programs and other information. The Bebunge application functions as an application for complaints and aspirations from the public which will then be forwarded to the relevant section for follow-up.",
      "image": "/src/assets/images/projects/bebunge.png",
      "technologies": ["Flutter", "Bloc", "REST API", "Google Maps API"],
      "link": "https://play.google.com/store/apps/details?id=apps.diskominfobekasikab.bebunge"
    },
    {
      "id": 2,
      "title": "Prosmart",
      "description": "ProSmart application is the first free online evidence return application in Indonesia. You can download this ProSmart application on Playstore. In this application you can check your belongings that have been used as evidence in court at the Cikarang District Court",
      "image": "/src/assets/images/projects/prosmart.png",
      "technologies": ["Flutter", "Bloc", "REST API"],
      "link": "https://play.google.com/store/apps/details?id=com.zen.prosmart"
    },
    {
      "id": 3,
      "title": "UniGuardZ",
      "description": "UniGuard Z is the next generation staff presence, guard tour management and location verification platform developed from over 20 years of experience in the Australian security and hygiene industry. Designed to be incredibly simple and flexible enough to capture the exact data you need, delivered straight to your inbox! UniGuard has successfully fought public litigation claims, secured payment for services rendered and streamlined your workforce operations by helping to ensure data transparency across your workforce.",
      "image": "/src/assets/images/projects/uniguardz.png",
      "technologies": ["Flutter", "Kotlin", "Swift", "SQLite", "REST API", "Google Maps API"],
      "link": "https://play.google.com/store/apps/details?id=com.uniguard.uniguard_z"
    },
    {
      "id": 4,
      "title": "PTT Uniguard",
      "description": "Introducing UNIGUARD PTT, a modern communication solution designed to simplify and accelerate your team's communication. In this digital era, we understand that speed, efficiency, and security are key to maintaining smooth business or organization operations. Uniguard PTT is here as an answer to these needs by offering a reliable and easy-to-use Push-to-Talk (PTT) platform.",
      "image": "/src/assets/images/projects/ptt_uniguard.png",
      "technologies": ["Java", "REST API", "WebSocket", "Mumble Server", "Google Maps API"],
      "link": "https://play.google.com/store/apps/details?id=com.uniguard.ptt_app"
    },
    {
      "id": 5,
      "title": "GPS Uniguard",
      "description": "GPS Uniguard is a mobile application for managing GPS tracking devices. It requires a Traccar server instance to work.",
      "image": "/src/assets/images/projects/gps_uniguard.png",
      "technologies": ["Kotlin", "Swift", "WebView", "Caching"],
      "link": "https://play.google.com/store/apps/details?id=com.uniguard.gps"
    },
    {
      "id": 6,
      "title": "BLE Uniguard",
      "description": "BLE Uniguard is a mobile application for managing BLE tracking devices. It requires a Traccar server instance to work.",
      "image": "/src/assets/images/projects/ble_uniguard.png",
      "technologies": ["Kotlin", "REST API", "BLE"],
      "link": "https://play.google.com/store/apps/details?id=com.uniguard.ble_scanner"
    }
  ],
  "contact": {
    "email": "fahtul.singaparna@gmail.com",
    "phone": "+6281313320710",
    "location": "Tasikmalaya, West Java",
    "social": {
      "linkedin": "https://www.linkedin.com/in/fathul-hidayat-dev",
      "github": "https://github.com/Kirara02"
    }
  }
} 